service-zhwg-ywkt-mtosi-master/template/烽火/request/deactiveAndDeleteSubnetworkConnection.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rp/xsd/conc/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:v13="http://www.tmforum.org/mtop/nrf/xsd/tpdata/v1" xmlns:v14="http://www.tmforum.org/mtop/nrb/xsd/lp/v1" xmlns:v15="http://www.tmforum.org/mtop/fmw/xsd/gen/v1">
    <soapenv:Header>
        <v1:header>
            <v1:communicationStyle>RPC</v1:communicationStyle>
            <v1:security>admin:admin</v1:security>
            <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
        </v1:header>
    </soapenv:Header>
    <soapenv:Body>
        <v11:deactivateAndDeleteSubnetworkConnectionRequest>
            <v11:sncRef>
                <v12:rdn>
                    <v12:type>MD</v12:type>
                    <v12:value>FH100GJituan</v12:value>
                </v12:rdn>
                <v12:rdn>
                    <v12:type>MLSN</v12:type>
                    <v12:value>1</v12:value>
                </v12:rdn>
                <v12:rdn>
                    <v12:type>SNC</v12:type>
                    <v12:value>503320552_520097742</v12:value>
                </v12:rdn>
            </v11:sncRef>
        </v11:deactivateAndDeleteSubnetworkConnectionRequest>
    </soapenv:Body>
</soapenv:Envelope>